CREATE OR REPLACE PACKAGE KK_XXI.FOR_CD_QUEUE IS

    --
    -- Внутренние вызовы. Пакет взаимодействия с очередями для кредитных договоров.
    --

    Version CONSTANT VARCHAR2 (250) := 'v 0.01 20.04.2022';

    --  Описание:
    --
    -- ADD_IN_QUEUE_CD  - процедура добавления кредитного договора в очередь
    --

-------------------------------------------------------------------------------
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------
-- процедура добавляет в очередь кредитный договор
PROCEDURE ADD_IN_QUEUE_CD(P_AGRID IN NUMBER -- ID кредитного договора
                          ); 
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------
-------------------------------------------------------------------------------   
END FOR_CD_QUEUE;
/